In [52]:
#Aula BootCamp com Guilherme Ribeiro 
#Aluno: José Wellington Albuquerque
# Material suplementar para o Curso Data Science Banco Carrefour
import pandas as pd
import numpy as np

from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

In [53]:
dados=pd.read_csv('/content/train.csv')
#Dataset Kaggle, disponível em: https://www.kaggle.com/rahulsah06/titanic?select=train.csv

In [54]:
dados.head()#mostra as 5 linhas iniciais da tabela

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [55]:
dados = dados.drop(['Name','Ticket','Cabin','Embarked'], axis = 1)#a função drop faz uma limpeza prévia dos dados

In [47]:
dados.head()

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0       3    male  22.0      1      0   7.2500
2                   1       1  female  38.0      1      0  71.2833
3                   1       3  female  26.0      0      0   7.9250
4                   1       1  female  35.0      1      0  53.1000
5                   0       3    male  35.0      0      0   8.0500

In [56]:
dados = dados.set_index(['PassengerId']) #criação de chave index em dados.set_index
dados = dados.rename(columns={'Survived':'target'}, inplace= False) #Survived foi renomeada como variável alvo

In [58]:
dados.head()

             target  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
1                 0       3    male  22.0      1      0   7.2500
2                 1       1  female  38.0      1      0  71.2833
3                 1       3  female  26.0      0      0   7.9250
4                 1       1  female  35.0      1      0  53.1000
5                 0       3    male  35.0      0      0   8.0500

Início da Análise Descritiva partir de variáveis numéricas: com dados.describe() a

In [60]:
dados.describe()

           target      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [62]:
dados.describe(include= ['O']) #Seleção da variavel Sex para análise

         Sex
count    891
unique     2
top     male
freq     577

In [64]:
dados['Sex_F'] = np.where(dados['Sex'] == 'female', 1, 0) #transformação de uma string para numérica, onde feminino será considerado 1 e masculino 0
#assim estamos fazendo uma flag.
dados['Pclass_1'] = np.where(dados['Pclass'] == 1, 1, 0) #1ª classe de passageiro do navio
dados['Pclass_2'] = np.where(dados['Pclass'] == 2, 1, 0) #2ª classe de passageiro do navio
dados['Pclass_3'] = np.where(dados['Pclass'] == 3, 1, 0) #3ª classe de passageiro do navio

In [67]:
dados.head()

             target  Pclass     Sex   Age  ...  Sex_F  Pclass_1  Pclass_2  Pclass_3
PassengerId                                ...
1                 0       3    male  22.0  ...      0         0         0         1
2                 1       1  female  38.0  ...      1         1         0         0
3                 1       3  female  26.0  ...      1         0         0         1
4                 1       1  female  35.0  ...      1         1         0         0
5                 0       3    male  35.0  ...      0         0         0         1

[5 rows x 11 columns]

In [69]:
dados=dados.drop(['Pclass','Sex'], axis=1)

In [71]:
dados.head()#Agora você pode perceber que há 3 colunas para Classes

             target   Age  SibSp  Parch  ...  Sex_F  Pclass_1  Pclass_2  Pclass_3
PassengerId                              ...
1                 0  22.0      1      0  ...      0         0         0         1
2                 1  38.0      1      0  ...      1         1         0         0
3                 1  26.0      0      0  ...      1         0         0         1
4                 1  35.0      1      0  ...      1         1         0         0
5                 0  35.0      0      0  ...      0         0         0         1

[5 rows x 9 columns]

In [72]:
dados.isnull().sum()# encontramos 177 resultados

target        0
Age         177
SibSp         0
Parch         0
Fare          0
Sex_F         0
Pclass_1      0
Pclass_2      0
Pclass_3      0
dtype: int64

In [75]:
dados.fillna(0,inplace=True) #substituimos os dados perdidos por zero e

In [77]:
dados.isnull().sum() #resumo das variáveis

target      0
Age         0
SibSp       0
Parch       0
Fare        0
Sex_F       0
Pclass_1    0
Pclass_2    0
Pclass_3    0
dtype: int64

In [79]:
x_train, x_test, y_train, y_test = train_test_split(dados.drop(['target'], axis=1), #amostragem conforme a variável alvo
                                                    dados["target"], #parâmetro da divisão é a variável Survived
                                                    test_size = 0.3, #definição do BD na proporçao 30% para teste e 70% treino
                                                    random_state = 1234) #fixa o resultado de precisão do modelo para reprodução posterior

[{'treino': x_train.shape},{'teste': x_test.shape}] #Observe aque houve uma divisão notreino e teste com número de linhas e colunas para cada BD

[{'treino': (623, 8)}, {'teste': (268, 8)}]

In [81]:
rndforest = RandomForestClassifier(n_estimators= 1000, #criação do modelo com 1000 árvores
                                   criterion= 'gini', #fixa o criterio de análise, gini isola em 1 ramo da árvore a classe mais frequente                              
                                   max_depth= 5) #seta o max de profundidade das árvores

rndforest.fit(x_train, y_train) #modelagem faz calculos conforme algorítmo adotado nos parâmetros passados

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [83]:
probabilidade = rndforest.predict_proba(dados.drop('target',axis = 1))[:,1] #modelo preditivo com regressão e probalidade de sobreviventes 
classificacao = rndforest.predict(dados.drop('target', axis= 1)) #modelo preditivo e com classificação duas variáveis: sobrevivente ou não sobrevivente

In [85]:
dados['probabilidade'] = probabilidade #coluna da probabilidade
dados['classificacao'] = classificacao #coluna resultado da classificação

In [87]:
dados #análise final do modelo supervisionado para prever a probabilidade de sobrevivência

             target   Age  SibSp  ...  Pclass_3  probabilidade  classificacao
PassengerId                       ...
1                 0  22.0      1  ...         1       0.120563              0
2                 1  38.0      1  ...         0       0.940515              1
3                 1  26.0      0  ...         1       0.433520              0
4                 1  35.0      1  ...         0       0.925972              1
5                 0  35.0      0  ...         1       0.140600              0
...             ...   ...    ...  ...       ...            ...            ...
887               0  27.0      0  ...         0       0.125375              0
888               1  19.0      0  ...         0       0.862597              1
889               0   0.0      1  ...         1       0.484078              0
890               1  26.0      0  ...         0       0.449812              0
891               0  32.0      0  ...         1       0.161883              0

[891 rows x 11 columns]

In [ ]:
#A partir das probabilidades dá para fazer novos tratamentos ou testar novos modelos preditivos